package ru.javarush.java.core.level04.task17;

public class Solution {
    public static void main(String[] args) {
        // Внешний цикл для строк (i от 0 до 2)
//        for (/* инициализация */; /* условие */; /* изменение */) {
//            // Внутренний цикл для столбцов (j от 0 до 3)
//            for (/* инициализация */; /* условие */; /* изменение */) {
//                // Вывод координат текущей ячейки в формате i,j
//
//                // Добавляем пробел между координатами в строке, кроме последней
//                if (/* условие */) {
//
//                }
//            }
//            // Переход на новую строку после завершения внутреннего цикла
//
//        }
    }
}