package ru.javarush.java.core.level04.task18;

public class Solution {
    public static void main(String[] args) {
        // Внешний цикл отвечает за строки (5 строк)
        for (/* инициализация */; /* условие */; /* изменение */) {
            // Внутренний цикл отвечает за столбцы (7 столбцов)
            for (/* инициализация */; /* условие */; /* изменение */) {
                // Выводим символ "⭐" с пробелом

            }
            // После завершения строки переходим на новую строку

        }
    }
}