package ru.javarush.java.core.level07.task15;

public class Solution {
    public static void main(String[] args) {
        // Создаем зубчатый массив с заданными значениями
        // Первая строка массива
        // Вторая строка массива
        // Третья строка массива

        // Переменная для хранения суммы всех элементов массива


        // Проходим по каждой строке массива

        // Проходим по каждому элементу строки

        // Добавляем значение элемента к общей сумме



        // Выводим итоговую сумму на экран

    }
}