package ru.javarush.java.core.level04.task11;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения ввода пользователя


        // переменная для хранения выбранного пункта меню


        // Используем do-while, чтобы меню показывалось хотя бы один раз и повторялось до выбора "Выйти"
//        do {
//            // Печатаем меню в каждом цикле
//
//            // Считываем номер выбранного пункта
//
//
//            // Обработка выбора
//            if (/* условие */) {
//
//            }
//            // При выборе 2 цикл завершится благодаря условию while ниже
//            // Для других значений просто снова покажем меню
//        } while (/* условие */);
    }
}