
### Первая команда

Напишите программу на Java, которая выводит на экран фразу: "Круто быть программистом!😎"

Требования:
1. Программа должна выводить на экран фразу: Круто быть программистом!😎
2. Для вывода текста должно использоваться выражение System.out.println.