package ru.javarush.java.core.level04.task04;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем Scanner для чтения данных с консоли


        // Сумма всех введенных стоимостей


        // Запрашиваем первую стоимость чашки кофе


        // Используем цикл while для продолжения ввода до тех пор, пока не будет введено отрицательное число
        while (/* условие */) {
            // Добавляем введенную стоимость к общей сумме

            // Запрашиваем следующую стоимость

        }

        // Выводим итоговую сумму расходов на кофе (отрицательное значение в сумму не входит)

    }
}