package ru.javarush.java.core.level04.task19;

public class Solution {
    public static void main(String[] args) {
        int size = 8; // Размер игрового поля (8 строк и 8 столбцов)

        // Внешний цикл по строкам
        for (/* инициализация */; /* условие */; /* изменение */) {
            // Внутренний цикл по столбцам
            for (/* инициализация */; /* условие */; /* изменение */) {
                // Клетка белая, если сумма индексов четная; иначе — черная

            }
            // Переход на новую строку после каждой строки поля

        }
    }
}