package ru.javarush.java.core.level07.task08;

public class Solution {
    public static void main(String[] args) {
        // Быстрая инициализация массива с 6 элементами температур


        // Предполагаем, что первый элемент массива является максимальным


        // Проходим по всем элементам массива, начиная со второго

        // Если текущая температура больше сохранённой максимальной

        // Обновляем максимальную температуру



        // Выводим найденную максимальную температуру

    }
}