package ru.javarush.java.core.level05.task01;

import java.util.Scanner;

public class Solution {
    public static void main(String[] args) {
        // Создаем объект Scanner для чтения ввода пользователя


        // Запрашиваем у пользователя высоту лестницы


        // Внешний цикл — по количеству ступеней (строк)
        for (/* инициализация */; /* условие */; /* изменение */) {
            // Внутренний цикл — печатает нужное количество символов '#'
            for (/* инициализация */; /* условие */; /* изменение */) {

            }
            // Переход на новую строку после каждой ступеньки

        }
    }
}