package ru.javarush.java.core.level04.task13;

public class Solution {
    public static void main(String[] args) {
        // Перебираем числа от 1 до 10 включительно
//        for (/* инициализация */; /* условие */; /* изменение */) {
//            // Проверяем, является ли текущее число верным кодом
//            if (/* условие */) {
//                // Если код найден, выводим сообщение
//
//                // Прерываем цикл, так как код найден
//                break;
//            }
//        }
    }
}