
### Составление фразы из слов 📝

Представьте, что вы собираете фразу по частям. Напишите программу, которая выводит на экран две строки, каждая на новой строке. Используйте для этого разные команды System.out.println():

 - Первая строка: "Я учу Java."
 - Вторая строка: "Это интересно!"

Выведите каждое слово (Я, учу, Java, Это, интересно) отдельной командой System.out.print() или System.out.println().

#### Требования:
1. Для вывода каждого слова должна быть использована отдельная команда System.out.print() или System.out.println(). 
2. Слова должны выводиться в следующем порядке: "Я", "учу", "Java", затем "Это", "интересно". 
3. В результате на экране должно появиться две строки: первая — "Я учу Java.", вторая — "Это интересно!". 
4. Каждая из двух итоговых строк должна выводиться на новой строке экрана.