package ru.javarush.java.core.level07.task12;

public class Solution {
    public static void main(String[] args) {
        // Создаем двумерный массив для хранения показаний (2 строки, 5 столбцов)

        // Начальное значение для заполнения массива


        // Заполняем массив по строкам, слева направо





        // Выводим массив в виде таблицы


        // Печатаем значение элемента

        // Если это не последний элемент в строке, добавляем пробел



        // После каждой строки переходим на новую


    }
}