
### Сообщение в чате 💬

Представьте, что вы отправляете сообщение в чат. Напишите программу, которая выводит на экран текущий год — 2025 — и смайлик 😅. Каждое сообщение должно быть на отдельной строке.

#### Требования:
1. Программа должна вывести на экран число 2025. 
2. Программа должна вывести на экран смайлик 😅. 
3. Число 2025 и смайлик 😅 должны выводиться на отдельных строках, а не в одной строке. 
4. Для вывода сообщений на экран необходимо использовать команду System.out.println.