package ru.javarush.java.core.level04.task07;

public class Solution {
    public static void main(String[] args) {
        // Объявляем переменную N для хранения количества товаров


        // Переменная для хранения общей стоимости


        // Используем цикл for для подсчета общей стоимости товаров
        for (/* инициализация */; /* условие */; /* изменение */) {
            // Добавляем стоимость текущего товара (равную его порядковому номеру)

        }

        // Выводим общую стоимость всех товаров

    }
}