package ru.javarush.java.core.level07.task16;

public class Solution {
    public static void main(String[] args) {
        // Создаем зубчатый массив с заданным количеством элементов в каждой строке
        // Зона A: три датчика
        // Зона B: два датчика
        // Зона C: четыре датчика

        // Инициализируем переменную для хранения максимального значения


        // Проходим по всем элементам зубчатого массива


        // Обновляем максимальное значение, если текущая температура больше




        // Выводим максимальное значение температуры на экран

    }
}