package ru.javarush.java.core.level06.task01;

public class Solution {
    public static void main(String[] args) {
        // Объявляем уровень персонажа (тип byte)

        // Объявляем показатель брони (тип short)

        // Объявляем накопленный опыт (тип int)

        // Объявляем количество золотых монет (тип long)

        // Объявляем сопротивление магии (тип float)

        // Объявляем шанс критического удара (тип double)


        // Выводим каждую характеристику героя на новой строке





    }
}