package ru.javarush.java.core.level04.task20;

public class Solution {
    public static void main(String[] args) {
        // Внешний цикл перебирает значения i от 1 до 10
        for (/* инициализация */; /* условие */; /* изменение */) {
            // Внутренний цикл перебирает значения j от 1 до 10
            for (/* инициализация */; /* условие */; /* изменение */) {
                // Проверяем, равна ли сумма i и j числу 13
//                if (/* условие */) {
//                    // Если сумма равна 13, выводим результат
//
//                    // Завершаем оба цикла с помощью return
//                    return;
//                }
            }
        }
    }
}